{"meta":{"title":"Real Sheet Collection","subtitle":"Playing tabletop roleplaying games has never been easier","description":"Quickly and easily access all your RPG game characters. Modify them intuitively, create reusable models, save data and more","author":"B4B0PaD","url":"https://realsheetcollection.com","root":"/"},"pages":[{"title":"Features","date":"2021-01-24T17:24:42.000Z","updated":"2021-02-02T10:08:46.000Z","comments":true,"path":"features/index.html","permalink":"https://realsheetcollection.com/features/","excerpt":"","text":"In this section we will look in detail at what the application makes available to the player. In the course of future developments of these features will increase, as well as a greater number of supported games. Base FeaturesReal Sheet Collection in its free version aims to allow the user to fully play his favorite role-playing game. Some features will be limited, but fully unlockable upon purchase. This will allow the user to be able to test and evaluate them before any expenditure. Choice of many tabletop RPG gamesOnce the application is open, using the “+” button you can choose the role-playing game you want to play.Once the choice has been made, the list of personal character sheets will appear, containing the desired game.It is possible to have only one character sheet in the free version of the app. To try another game you will need to delete the previous character sheet. Creation of editable character sheetsEach character sheet can have from one to four pages, and will be fully editable by the user.In the case of multiple pages, it is possible to switch from one to the other using the tab bar below. Automatic main list, with main datas of each characterEach character sheet, once filled in by the user, will automatically customize the main list of character sheets, by entering the main datas for each of them.This will allow easy recognition of the character sheet by the player. Dice roller integrated into each sheetFrom each character sheet it will be possible to access the Dice Roller, in order to make the game experience richer and faster.It is possible to activate the Dice Table through the action button or by making a tap with three fingers on any page of the character sheet. Selective note area for each characterEach character sheet has a dedicated area, accessible via the tab bar, for any notes. It is a fully editable full screen text field. Print your sheets via Apple AirPrintThrough the action button of each character sheet it will be possible to print it via Airprint, with all the data filled in by the user. Generate PDF sheet fileThrough the action button of each character sheet it will be possible to generate it in PDF format, with all the data filled in by the user. Share your charactersEach character sheet of Real Sheet Collection can be shared in various ways, in PDF format:• By sending the files manually generated and saved in the device• By direct sending via Mail• By direct sending via Apple AirDrop Premium FeaturesReal Sheet Collection in its premium version aims to allow the user to play his favorite role-playing game in full. All the features made available will be usable without any restrictions.This will allow the user the best gaming experience during role playing. You can purchase a single RPG, which will unlock Real Sheet Collection features selectively, or you can purchase full application unlock.This last option will allow you to have no restrictions for all the games present, and for all future games. Unlimited number of character sheetsBy purchasing the single game you will get the possibility to create the related character sheets, without any limit of number.By purchasing the total unlock of the application you will get the possibility to create infinite character sheets of each game available.Using the “Edit” button in the main list of character sheets, it will also be possible to order them at will, by dragging them to the desired position. Unlimited number of dice formulasAs visible in the Dice Roller area, it is possible to save dice rolling combinations, called formulas, by associating them with an identifying name.It will now be possible to save infinite formulas. Very useful in the case of managing data for spells rolls, hit rolls, damage calculation and probability calculation. Sheet models: create, save and reuse them by Dropbox integrationThanks to this feature, from the action menu of each character sheet it will be possible to save and load the data entered into it.This option can be very useful for:• Save the character, even several times, to create backups• Create reusable templates to generate characters No advertisingAny purchase by the user will automatically and permanently remove the advertising banners present within the application."},{"title":"RS Collection","date":"2021-02-02T10:03:51.000Z","updated":"2021-02-02T10:03:51.000Z","comments":true,"path":"index.html","permalink":"https://realsheetcollection.com/","excerpt":"","text":"How many times it happened to be together with your friends and say Why don&#39;t we play our role-playing game? And someone responds I&#39;d love to but I don&#39;t have the character sheet with meI&#39;d love to but I don&#39;t have the dice set, the eraser and the pencils Thanks to Real Sheet Collection you can simply play because you want to do it, whenever you want! And without depending on paper or dice. Through the application it will be quick and easy to access all yours character sheets, and use when required the Dice Roller. Tested for months by two different groups of RPG players with more than 10 years of experience! If you are a player you will have with you everything you need to play. If you are a dungeon master, on the other hand, you will have all the characters of the story with you, and thanks to the template saving system will also have the opportunity to create more of them instantly. Don’t like the idea of playing a role-playing game through an application?I agree with you, but it will be useful if you do not have the material at the moment: use the application as a backup copy, and print your character sheet already filled in when starting the game session! Here are some reference screenshots for iPhone and iPad, but if you seek more details you will find everything you need within the page of your favorite RPG. Take a look at the games currently supported in the collection, in continuous expansion. Gallery iPhone iPad"},{"title":"Privacy Policy","date":"2021-01-24T16:31:45.000Z","updated":"2021-01-24T16:31:45.000Z","comments":true,"path":"privacy-policy/index.html","permalink":"https://realsheetcollection.com/privacy-policy/","excerpt":"","text":"Andrea Babini built the Real Sheet Collection app as an Ad Supported app. This SERVICE is provided by Andrea Babini at no cost and is intended for use as is. This page is used to inform visitors regarding my policies with the collection, use, and disclosure of Personal Information if anyone decided to use my Service. If you choose to use my Service, then you agree to the collection and use of information in relation to this policy. The Personal Information that I collect is used for providing and improving the Service. I will not use or share your information with anyone except as described in this Privacy Policy. The terms used in this Privacy Policy have the same meanings as in our Terms and Conditions, which is accessible at Real Sheet Collection unless otherwise defined in this Privacy Policy. Information Collection and UseFor a better experience, while using our Service, I may require you to provide us with certain personally identifiable information, including but not limited to Dropbox service. The information that I request will be retained on your device and is not collected by me in any way. The app does use third party services that may collect information used to identify you. Link to privacy policy of third party service providers used by the app Log DataI want to inform you that whenever you use my Service, in a case of an error in the app I collect data and information (through third party products) on your phone called Log Data. This Log Data may include information such as your device Internet Protocol (“IP”) address, device name, operating system version, the configuration of the app when utilizing my Service, the time and date of your use of the Service, and other statistics. CookiesCookies are files with a small amount of data that are commonly used as anonymous unique identifiers. These are sent to your browser from the websites that you visit and are stored on your device’s internal memory. This Service does not use these “cookies” explicitly. However, the app may use third party code and libraries that use “cookies” to collect information and improve their services. You have the option to either accept or refuse these cookies and know when a cookie is being sent to your device. If you choose to refuse our cookies, you may not be able to use some portions of this Service. Service ProvidersI may employ third-party companies and individuals due to the following reasons: To facilitate our Service;To provide the Service on our behalf;To perform Service-related services; orTo assist us in analyzing how our Service is used.I want to inform users of this Service that these third parties have access to your Personal Information. The reason is to perform the tasks assigned to them on our behalf. However, they are obligated not to disclose or use the information for any other purpose. SecurityI value your trust in providing us your Personal Information, thus we are striving to use commercially acceptable means of protecting it. But remember that no method of transmission over the internet, or method of electronic storage is 100% secure and reliable, and I cannot guarantee its absolute security. Links to Other SitesThis Service may contain links to other sites. If you click on a third-party link, you will be directed to that site. Note that these external sites are not operated by me. Therefore, I strongly advise you to review the Privacy Policy of these websites. I have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services. Children’s PrivacyThese Services do not address anyone under the age of 13. I do not knowingly collect personally identifiable information from children under 13. In the case I discover that a child under 13 has provided me with personal information, I immediately delete this from our servers. If you are a parent or guardian and you are aware that your child has provided us with personal information, please contact me so that I will be able to do necessary actions. Changes to This Privacy PolicyI may update our Privacy Policy from time to time. Thus, you are advised to review this page periodically for any changes. I will notify you of any changes by posting the new Privacy Policy on this page. These changes are effective immediately after they are posted on this page. Contact UsIf you have any questions or suggestions about my Privacy Policy, do not hesitate to contact me at &#x62;&#x34;&#x62;&#x30;&#x70;&#x61;&#100;&#x2e;&#97;&#x70;&#x70;&#115;&#64;&#103;&#x6d;&#x61;&#105;&#x6c;&#x2e;&#99;&#x6f;&#x6d;."},{"title":"Author","date":"2021-01-26T10:10:08.000Z","updated":"2021-02-01T13:16:22.000Z","comments":true,"path":"author/index.html","permalink":"https://realsheetcollection.com/author/","excerpt":"","text":"My name is Andrea, nickname B4B0PaD,always passionate about role-playing games. I spent most of my childhood playing Mutant Chronicles, World of Darkness and the inevitable Dungeons and Dragons, in its various versions, both as a player and as a dungeon master. I work as a programmer for many years, so i said to myself “why not combine business with pleasure?”.Thus was born the first Apple application, related only to World of Darkness. Some experiments with editable character sheets followed, which eventually led to Real Sheet Collection, able to collect them all in one single place. For any information relating to my profile you can use the Linkedin link from the sidebar.The whole application, this site, the marketing… it’s all “home made”, the result of a passion for programming and role-playing games. I hope that you players and dungeon masters like this personal project, if you want you can support my work and future updates by purchasing your favorite game within the App :)"},{"title":"Supported Games","date":"2021-01-24T18:21:12.000Z","updated":"2021-01-27T17:15:57.000Z","comments":true,"path":"supported-games/index.html","permalink":"https://realsheetcollection.com/supported-games/","excerpt":"","text":""},{"title":"Dice Roller","date":"2021-01-26T13:31:04.000Z","updated":"2021-02-02T10:07:06.000Z","comments":true,"path":"dice-roller/index.html","permalink":"https://realsheetcollection.com/dice-roller/","excerpt":"","text":"Each role-playing game needs its own dice set, so each character sheet is able to give direct access to the dice roller.Use the character sheet menu to access it, or use the three finger tap on any page.It consists of two sections, accessible via the swipe gesture: The calculatorLike a common calculator, just write the complete expression to get the result.A simple example could be one 6-sided dice, to which add the value 1 1d6 + 1 A more complex example could be roll two 20-sided dice, add 4 and multiply all by the result of one 3-sided dice. (2d20 + 4) x (1d3) In the part below, next to the result you will see the whole expression with all the results of the dice rolls highlighted The formula collectorIt often happens that the same roll of the dice is repeated several times during the games, thanks to the formula collector you can collect each written expression, give it a name, and reuse it whenever you want. Gallery iPhone iPad"}],"posts":[{"title":"7th Sea - 2nd Edition","slug":"7th-sea-2nd-edition","date":"2021-01-21T23:00:01.000Z","updated":"2021-02-01T18:32:53.000Z","comments":true,"path":"supported-games/7th-sea-2nd-edition/","link":"","permalink":"https://realsheetcollection.com/supported-games/7th-sea-2nd-edition/","excerpt":"","text":"The gameThe 7th Sea RPG is set in a world that draws direct influence from the literature of 17th century Europe. Each country in the world can be compared to a European kingdom but is an exaggerated representation. Sorcery is a large part of the world with many types available to players. The dominant religion in the world, the belief in Theus and his prophets, is based on a form of Gnostic Christianity and features a parallel of the Spanish Inquisition. There are also references to the Knights Templars, Masons and the Invisible College of scientists. All major European powers have their representations in Théah. Avalon (England), Castille (Spain), Montaigne (France), Eisen (Germany), Ussura (Russia), Vendel/Vestenmanavnjar (Netherlands / Scandinavia) and Vodacce (Italy) are the main cultures of the game. There is also Inismore (Ireland), Highland Marches (Scotland), the Crescent Empire (Ottoman / Arab), Midnight Archipelago (Caribbean and North Africa) and the secretive Cathay (China / Korea / Tibet). The second edition introduced another nation, the Sarmatian Commonwealth (Polish–Lithuanian Commonwealth). Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"John Wick Presents","slug":"John-Wick-Presents","permalink":"https://realsheetcollection.com/tags/John-Wick-Presents/"}]},{"title":"Cthulhu 7th Edition","slug":"cthulhu-7th-edition","date":"2020-05-28T22:00:01.000Z","updated":"2021-02-01T18:34:19.000Z","comments":true,"path":"supported-games/cthulhu-7th-edition/","link":"","permalink":"https://realsheetcollection.com/supported-games/cthulhu-7th-edition/","excerpt":"","text":"The gameCall of Cthulhu is a horror fiction role-playing game based on H. P. Lovecraft’s story of the same name and the associated Cthulhu Mythos. Playing the role of steadfast investigators, you travel to strange and dangerous places, uncover foul plots, and stand against the terrors of the Cthulhu Mythos. You encounter sanity-blasting entities, monsters, and insane cultists. Within strange and forgotten tomes of lore you discover revelations that man was not meant to know. You and your companions may very well decide the fate of the world. Gallery iPhone iPad","categories":[],"tags":[{"name":"d100 system","slug":"d100-system","permalink":"https://realsheetcollection.com/tags/d100-system/"},{"name":"Chaosium","slug":"Chaosium","permalink":"https://realsheetcollection.com/tags/Chaosium/"}]},{"title":"Star Wars","slug":"star-wars","date":"2019-09-12T22:00:01.000Z","updated":"2021-02-01T18:39:35.000Z","comments":true,"path":"supported-games/star-wars/","link":"","permalink":"https://realsheetcollection.com/supported-games/star-wars/","excerpt":"","text":"The gameFlee from Imperial entanglements; double-deal with Hutts and gangsters; and jump to lightspeed in the fastest hunk of junk in the galaxy. As a player, you’ll take on the role of a character from the rough-and-tumble side of the galaxy. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"Fantasy Flight Games","slug":"Fantasy-Flight-Games","permalink":"https://realsheetcollection.com/tags/Fantasy-Flight-Games/"}]},{"title":"Promethean: The Created","slug":"promethean-the-created","date":"2019-06-27T22:00:35.000Z","updated":"2021-02-01T18:38:37.000Z","comments":true,"path":"supported-games/promethean-the-created/","link":"","permalink":"https://realsheetcollection.com/supported-games/promethean-the-created/","excerpt":"","text":"The gameThe game is inspired by the classic tales of Frankenstein’s monster, the Golem and other such simulacra. The characters are individuals created by first dismembering and reassembling a human corpse in most cases or multiple corpses in others to form a human body, then animating the body with Pyros, the Divine Fire. The resulting creation is known as a Promethean. Animated by the Divine Fire, but lacking a soul, Prometheans seek the greatest prize they know: humanity. The Promethean is not human, in either the physiological or cognitive sense. It is a corpse that walks, its autonomic functions and soul replaced by the power of the Divine Fire. While the Divine Fire allows him to pass as a human from a distance, it does not make up for the lack of a soul. When a Promethean spends enough time around humans, the humans begin to fall prey to Disquiet, the feeling that there is something not just fundamentally different, but utterly wrong about the Promethean. There is only one true means by which to truly escape from Disquiet: attaining mortality. Such an act requires years of dedication, but it is possible for Prometheans. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Geist: The Sin-Eaters","slug":"geist-the-sin-eaters","date":"2019-06-27T22:00:30.000Z","updated":"2021-02-01T18:36:24.000Z","comments":true,"path":"supported-games/geist-the-sin-eaters/","link":"","permalink":"https://realsheetcollection.com/supported-games/geist-the-sin-eaters/","excerpt":"","text":"The gameA Geist is a kind of spirit that was once a ghost but has given up their mortal identity. Instead they have become an embodiment of the ideas and imagery of their own deaths. Players portray Sin Eaters who have died and returned to the world of the living. Unlike vampires, however, Sin Eaters (also called the Bound) are not undead, but rather living beings bound to fundamental forces of death. Upon the first death, every Sin Eater is approached by a Geist, an embodiment of an aspect or personification of death. In exchange for being returned to life, Sin Eaters allow the Geist to accompany them, effectively merging into each other in a symbiotic relation with the “human” in control. Upon this return to life, the Bound discover that they can see and interact with the restless shades of the dead, and must choose what to do with their second chance at life. In all instances, Sin Eaters are forced to deal with the dead, whether through altruism, greed, or just the plain fact that the dead will not leave them alone. Every Sin Eater has a Threshold, relating to the way in which they died. Thresholds can be somewhat fluid, depending on what aspect of death the Sin Eater-to-be focused on at the moment of death. For example, someone who drowns could be either one of the Prey, who are killed by nature, or one of the Silent, who die from deprivation (a lack of oxygen), or even one of the Torn, if they are held under water. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Hunter: The Vigil","slug":"hunter-the-vigil","date":"2019-06-27T22:00:25.000Z","updated":"2021-02-01T18:37:28.000Z","comments":true,"path":"supported-games/hunter-the-vigil/","link":"","permalink":"https://realsheetcollection.com/supported-games/hunter-the-vigil/","excerpt":"","text":"The gameHunters operate socially, in collectives and groups of various sizes. The smallest organizational unit in which hunters operate is the cell. Cells operate independently of one another, frequently without even being aware of the existence of other cells in the region. Individual cells make up for their lack of firepower with flexibility and local knowledge. Characters affiliations are categorized into 3 tiers: individuals who for various reasons do not affiliate with any organization other than their Cell, individuals who belong to Compacts, small and loosely connected organizations, and individuals who belong to Conspiracies, large global groups that command greater power and resources.Cells occasionally discover one another and band together for strength and mutual support. When multiple cells get together in a region, the organization often acquires an independent identity, a group structure known as a compact. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Changeling: The Lost","slug":"changeling-the-lost","date":"2019-06-27T22:00:20.000Z","updated":"2021-02-01T18:33:52.000Z","comments":true,"path":"supported-games/changeling-the-lost/","link":"","permalink":"https://realsheetcollection.com/supported-games/changeling-the-lost/","excerpt":"","text":"The gameChangeling: The Lost is the fifth supplementary role-playing game line published by White Wolf Publishing. It is primarily inspired by tales of changelings from European folklore but includes elements of similar stories from around the world. While superficially similar to the Classic World of Darkness game Changeling: The Dreaming, Changeling: The Lost approaches the legends from a more traditional perspective of mortals kidnapped by Fae and eschews the past life angle that characterized its predecessor. The dominant themes of the game are the pain of loss, the quest for identity, and the bittersweet nature of human existence. Changelings refer to themselves as “the Lost”: they were kidnapped by the godlike Fae, taken to an alien realm, and held prisoner. While trapped there (referred to as their “Durance”), they were forced to serve their otherworldly masters and endure inhuman tortures; to survive under the twisted laws underpinning Arcadia, they also had to undergo physical and supernatural metamorphoses. Many escape only to find that they have been replaced by a faerie simulacrum (called a “Fetch”) and that they have not been missed at all. Most also discover that time passed differently in Arcadia than in the mortal world, and they are either too old or too young to resume their normal lives. Those who can often attempt to pick up where they left off before they were taken, with varying degrees of success, while others try to build new human lives elsewhere. However even under the best possible circumstances, the Lost are no longer fully human; they have become part of both worlds and while they are still human enough to make sense of human things, they have metamorphosed just enough to skew their perceptions. Many embrace their new existences, compensating for the loss of their mortal lives by immersing themselves in changeling society. Most find that they have come to appreciate humanity in a new way, finding beauty in the most mundane or painful of experiences, aching for things they did not appreciate before their capture. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Mage: The Awakening","slug":"mage-the-awakening","date":"2019-06-27T22:00:15.000Z","updated":"2021-02-01T18:37:39.000Z","comments":true,"path":"supported-games/mage-the-awakening/","link":"","permalink":"https://realsheetcollection.com/supported-games/mage-the-awakening/","excerpt":"","text":"The gameIn the mythic past, a mysterious island existed with a single towering mountain, encircled by dragons that lived upon its summit. The mountain called to humanity through dreams and visions. Over time, the dragons left and the mountain continued to call. Some humans answered the call and sought it out. The humans who moved there discovered the first secrets of magic, and through magic they created the mighty city-state now known as Atlantis, Meru, Lemuria, etc. though its true name has been lost to time. Over time, the mages became filled with hubris, and began fighting over how it is best to lead the world. The battle separated the Earth into the Fallen World and the Supernal Realm, with the chasm of the Abyss in between. The Fallen World is the world where humanity now exists, and the Supernal realm is the realm of magic, where the victorious mages of long ago now reside. The Abyss that separates the two worlds prevents most of humanity from awakening to magic, and hampers the power of mages trapped in the Fallen World. Mages believe that the Supernal Realm is the truth of reality and the origin of magic. It is ruled by the Exarchs, powerful mages who have established themselves as its rulers. The Exarchs wish to snuff out the memory of “Atlantis” and knowledge of magic so that they will remain the supreme masters of reality. They are more godlike forces than human beings now, however this means that they must influence the Fallen World through servants. Resistance against the Exarchs is possible because of the Oracles, a small number (probably five) of Atlantean mages who also reached the Supernal Realm. They each created (or maybe are) one of the Watchtowers, which are locations in the Supernal Realms that can cut through the Abyss. They serve as paths towards magic, allowing Sleepers (humans unaware of magic) to awaken to it. Each mage visits a Watchtower during their Awakening—through means perhaps accidental, or perhaps resulting from a person’s nature or understanding—and their magical abilities are forever affected by that journey. Fragments of the organizations, artifacts and writings from the First City survive to the present day, and mages hope to use this knowledge to further their various causes, by gaining a stronger connection to the Supernal Realm. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Werewolf: The Forsaken","slug":"werewolf-the-forsaken","date":"2019-06-27T22:00:10.000Z","updated":"2021-02-01T18:40:24.000Z","comments":true,"path":"supported-games/werewolf-the-forsaken/","link":"","permalink":"https://realsheetcollection.com/supported-games/werewolf-the-forsaken/","excerpt":"","text":"The gamePlayers portray the Forsaken, werewolves, known as Uratha, who are sworn to a duty to maintain a balance and prevent ingress between the spirit worlds and the material world. Any human who may unknowingly possess a werewolf heritage could undergo a First Change at some time in their life, though what triggers the metamorphosis is unknown. It is known that it almost never happens before puberty or after the age of 60. Following this Change, each character develops an Auspice, defined by what phase the moon was at during their First Change, and most join a Tribe or become a tribe-less werewolf known as a Ghost Wolf. Unlike traditional fictional werewolves, Uratha may change at any time into various forms between man and wolf, though they do find this easier when the phase of the moon matches their Auspice. Uratha are fierce territorial predators who feel the compulsion to hunt. Many have trouble containing their aggression, hindering their ability to live normal human lives. Additionally, humans feel this aggression and are repelled by this feeling. Also, every werewolf is in danger of entering a violent Death Rage (Kuruth in the First Tongue). In this frenzied state the werewolf is a threat to everything, no matter whether friend or foe. Uratha also possess an instinctive understanding of the First Tongue, the language spoken by their ancestors and spirits. Although initially rudimentary, many Uratha can eventually learn to speak the First Tongue fluently. In the broader context of published setting material, the Uratha are a specialized form of were-beast in the Chronicles of Darkness setting, and belong to the so-called Changing Breeds (beings part human, part animal and part spirit). Among these beings, the Uratha are not the only shapeshifters, but are one of the breeds with the deepest spiritual connection. There are also other differences to the other Changing Breeds. However, the Uratha don’t have much contact with the other Changing Breeds and those Breeds mostly avoid the Uratha. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Vampire: The Requiem","slug":"vampire-the-requiem","date":"2019-06-27T22:00:05.000Z","updated":"2021-02-01T18:39:59.000Z","comments":true,"path":"supported-games/vampire-the-requiem/","link":"","permalink":"https://realsheetcollection.com/supported-games/vampire-the-requiem/","excerpt":"","text":"The gameThe game takes place in modern-day earth where vampires form complex societies hidden from human awareness. Vampires are unliving humans created when a vampire drains a human dry of blood and then feeds the corpse a few drops of its own vampiric blood. Vampires that have inherited common physical powers and qualities group themselves into “clans”, but they also join “covenants” along religious, political or philosophical lines. These groups differ radically in purpose and outlook and are often in conflict, though they agree that they must hide their existence from humans. Vampires generally dwell in large cities, where they can find plenty of prey and easily remain inconspicuous. Vampires do not need to kill humans to steal blood; humans go into a trance when a vampire feeds on them and do not remember the moment, and a vampire can erase the bite marks it made by licking them. While vampires use the stolen blood they call vitae to bolster their physical prowess, heal wounds, and wield Disciplines, it is also the fuel they use to arise every night; a vampire cannot awaken if it does not have any blood. Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Human: New World of Darkness","slug":"human-new-world-of-darkness","date":"2019-06-27T22:00:01.000Z","updated":"2021-02-01T18:36:37.000Z","comments":true,"path":"supported-games/human-new-world-of-darkness/","link":"","permalink":"https://realsheetcollection.com/supported-games/human-new-world-of-darkness/","excerpt":"","text":"The gameThe base character of all World of Darkness games. No power, no spells, but they are many! Gallery iPhone iPad","categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"}]},{"title":"Dungeons & Dragons 5th Edition","slug":"dungeons-and-dragons-5th-edition","date":"2019-06-24T22:00:25.000Z","updated":"2021-02-01T18:35:44.000Z","comments":true,"path":"supported-games/dungeons-and-dragons-5th-edition/","link":"","permalink":"https://realsheetcollection.com/supported-games/dungeons-and-dragons-5th-edition/","excerpt":"","text":"The gameIn direct contrast to the previous editions of the game, D&amp;D Next was developed partly via a public open playtest. An early build of the new edition debuted at the 2012 Dungeons &amp; Dragons Experience event to about 500 fans.The edition returns to having only three core rule books, with the Player’s Handbook containing most major races and classes. Mechanically, 5th edition draws heavily on prior editions, while introducing some new mechanics intended to simplify and streamline play. Skills, weapons, items, saving throws, and other things that characters are trained in now all use a single proficiency bonus that increases as character level increases. Multiple defense values have been removed, returning to a single defense value of armor class and using more traditional saving throws. Saving throws are reworked to be situational checks based on the six core abilities instead of generic d20 rolls. Feats are now optional features that can be taken instead of ability score increases and are reworked to be occasional major upgrades instead of frequent minor upgrades. The “advantage/disadvantage” mechanic was introduced, streamlining conditional and situational modifiers to a simpler mechanic: rolling two d20s for a situation and taking the higher of the two for “advantage” and the lower of the two for “disadvantage” and canceling each other out when more than one apply. Clerics, druids, paladins, and wizards prepare known spells using a slightly modified version of the spell preparation system of previous editions. Healing Surges are replaced by Hit Dice, requiring a character to roll a hit die during a short rest instead of healing a flat rate of hit points. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"},{"name":"Wizards of the Coast","slug":"Wizards-of-the-Coast","permalink":"https://realsheetcollection.com/tags/Wizards-of-the-Coast/"}]},{"title":"Pathfinder","slug":"pathfinder","date":"2019-06-24T22:00:20.000Z","updated":"2021-02-01T18:38:06.000Z","comments":true,"path":"supported-games/pathfinder/","link":"","permalink":"https://realsheetcollection.com/supported-games/pathfinder/","excerpt":"","text":"The gamePaizo released the stand-alone Pathfinder Roleplaying Game as a modified version of the version Dungeons &amp; Dragons 3.5 game, under the Open Game License used by the older version.Pathfinder adds many options to the classes and boosts their abilities in their core roles. The game has also been modified compared to D&amp;D version 3.5. Changes were made involving balance between different game elements. For example, less combat-oriented classes receive more hit points each level than their 3.5 counterparts. Additionally, several aspects of 3.5 have been changed in Pathfinder, including several spells, the skill system and combat maneuvers such as tripping and grappling. Each round, each character can perform up to three actions on their turn as well as one reaction on another’s turn. Most basic moves, such as moving across the ground, drawing a weapon, or making an attack cost a single action, while more complicated maneuvers may require two or three actions. The rules around magic items have been changed to discourage players from hoarding too many items and instead encouraging them to seek out more powerful equipment. Critical hits have also been changed – a critical success now occurs any time a combatant rolls 10 more than the target’s armor class. Combatants can also critically succeed when defending which usually results in no effect rather than the reduced effect a save would usually bring. Finally there has been a broad change to all number scaling of skills, armor class, attack rolls, saves, and difficulty classes. All these numbers now scale 1 to 1 with a character’s level plus a stat plus a bonus between two and eight depending on their proficiency. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"},{"name":"Paizo Publishing","slug":"Paizo-Publishing","permalink":"https://realsheetcollection.com/tags/Paizo-Publishing/"}]},{"title":"Dungeons & Dragons 4th Edition","slug":"dungeons-and-dragons-4th-edition","date":"2019-06-24T22:00:15.000Z","updated":"2021-02-01T18:35:20.000Z","comments":true,"path":"supported-games/dungeons-and-dragons-4th-edition/","link":"","permalink":"https://realsheetcollection.com/supported-games/dungeons-and-dragons-4th-edition/","excerpt":"","text":"The game4th edition saw a major overhaul of the game’s systems. Changes in spells and other per-encounter resourcing, giving all classes a similar number of at-will, per-encounter and per-day powers. Powers have a wide range of effects including inflicting status effects, creating zones, and forced movement, making combat very tactical for all classes but essentially requiring use of miniatures, reinforced by the use of squares to express distances. Attack rolls, skill checks and defense values all get a bonus equal to one-half level, rounded down, rather than increasing at different rates depending on class or skill point investment. Each skill is either trained (providing a fixed bonus on skill checks, and sometimes allowing more exotic uses for the skills) or untrained, but in either case all characters also receive a bonus to all skill rolls based on level. A system of “healing surges” and short and long rests are introduced to act as resource management. The system of prestige classes is replaced by a system in which characters at 11th level choose a “paragon path”, a specialty based on their class, which defines some of their new powers through 20th level; at level 21, an “epic destiny” is chosen in a similar manner. Core rules extend to level 30 rather than level 20, bringing “epic level” play back into the core rules. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"},{"name":"Wizards of the Coast","slug":"Wizards-of-the-Coast","permalink":"https://realsheetcollection.com/tags/Wizards-of-the-Coast/"}]},{"title":"Dungeons & Dragons 3.5 Edition","slug":"dungeons-and-dragons-3-5-edition","date":"2019-06-24T22:00:10.000Z","updated":"2021-02-01T18:34:45.000Z","comments":true,"path":"supported-games/dungeons-and-dragons-3-5-edition/","link":"","permalink":"https://realsheetcollection.com/supported-games/dungeons-and-dragons-3-5-edition/","excerpt":"","text":"The gameIn July 2003, a revised version of the 3rd edition D&amp;D rules (termed v. 3.5) was released that incorporated numerous small rule changes, as well as expanding the Dungeon Master’s Guide and Monster Manual. This revision was intentionally a small one focusing on addressing common complaints about certain aspects of gameplay, hence the “half edition” version number. The basic rules are fundamentally the same, only differing in balancing.Many monsters and items are compatible (or even unchanged) between those editions. New spells are added, and numerous changes are made to existing spells, while some spells are removed from the updated Player’s Handbook. New feats are added and numerous changes are made to existing feats, while several skills are renamed or merged with other skills. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"},{"name":"Wizards of the Coast","slug":"Wizards-of-the-Coast","permalink":"https://realsheetcollection.com/tags/Wizards-of-the-Coast/"}]},{"title":"Dungeons & Dragons 3rd Edition","slug":"dungeons-and-dragons-3rd-edition","date":"2019-06-24T22:00:05.000Z","updated":"2021-02-01T18:35:00.000Z","comments":true,"path":"supported-games/dungeons-and-dragons-3rd-edition/","link":"","permalink":"https://realsheetcollection.com/supported-games/dungeons-and-dragons-3rd-edition/","excerpt":"","text":"The gameA major revision of the AD&amp;D rules was released in 2000, the first edition published by Wizards of the Coast.Saving throws are reduced from five categories based on forms of attack to three based on type of defense. The combat system is greatly expanded, adopting into the core system most of the optional movement and combat system of the 2nd edition Players Option: Combat and Tactics book. Third edition combat allows for a grid system, encouraging highly tactical gameplay and facilitating the use of miniatures. New character options were introduced. The new sorcerer class was introduced. The thief is renamed rogue, a term that 2nd edition uses to classify both the thief and bard classes, and introduces prestige classes, which characters can only enter at higher character levels, and only if they meet certain character-design prerequisites or fulfill certain in-game goals. Later products included additional and supplementary rules subsystems such as “epic-level” options for characters above 20th level, as well as a heavily revised treatment of psionics. 3rd edition removes previous editions’ restrictions on class and race combinations that were intended to track the preferences of the race, and on the level advancement of non-human characters. Skills and the new system of feats are introduced replacing non-weapon proficiencies, to allow players to further customize their characters. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"},{"name":"Wizards of the Coast","slug":"Wizards-of-the-Coast","permalink":"https://realsheetcollection.com/tags/Wizards-of-the-Coast/"}]},{"title":"Advanced Dungeons & Dragons","slug":"advanced-dungeons-and-dragons","date":"2019-06-24T22:00:01.000Z","updated":"2021-02-01T18:33:27.000Z","comments":true,"path":"supported-games/advanced-dungeons-and-dragons/","link":"","permalink":"https://realsheetcollection.com/supported-games/advanced-dungeons-and-dragons/","excerpt":"","text":"The gameAn updated version of D&amp;D was released between 1977 and 1979 as Advanced Dungeons &amp; Dragons (AD&amp;D). The game rules were reorganized and re-codified across three hardcover rulebooks, compiled by Gary Gygax, incorporating the original D&amp;D rules and many additions and revisions from supplements and magazine articles. The three core rulebooks were the Monster Manual (1977), the Player’s Handbook (1978), and the Dungeon Master’s Guide (1979).Major additions included classes from supplements like assassin, druid, monk, paladin, and thief, while bard, illusionist, and ranger, which had previously only appeared in magazine articles, were added to the core rulebooks. An alignment system with nine alignments was used, rather than the previous three-alignment system in the original D&amp;D rules. Later supplements for AD&amp;D included Deities &amp; Demigods (1980), Fiend Folio (another book of monsters produced semi-autonomously in the UK - 1981), Monster Manual II (1983), Oriental Adventures, Unearthed Arcana (1985), which mostly compiled material previously published in Dragon magazine, and others. Gallery iPhone iPad","categories":[],"tags":[{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"}]}],"categories":[],"tags":[{"name":"d10 system","slug":"d10-system","permalink":"https://realsheetcollection.com/tags/d10-system/"},{"name":"John Wick Presents","slug":"John-Wick-Presents","permalink":"https://realsheetcollection.com/tags/John-Wick-Presents/"},{"name":"d100 system","slug":"d100-system","permalink":"https://realsheetcollection.com/tags/d100-system/"},{"name":"Chaosium","slug":"Chaosium","permalink":"https://realsheetcollection.com/tags/Chaosium/"},{"name":"d20 system","slug":"d20-system","permalink":"https://realsheetcollection.com/tags/d20-system/"},{"name":"Fantasy Flight Games","slug":"Fantasy-Flight-Games","permalink":"https://realsheetcollection.com/tags/Fantasy-Flight-Games/"},{"name":"White Wolf","slug":"White-Wolf","permalink":"https://realsheetcollection.com/tags/White-Wolf/"},{"name":"New world of darnkess","slug":"New-world-of-darnkess","permalink":"https://realsheetcollection.com/tags/New-world-of-darnkess/"},{"name":"d&d","slug":"d-d","permalink":"https://realsheetcollection.com/tags/d-d/"},{"name":"Wizards of the Coast","slug":"Wizards-of-the-Coast","permalink":"https://realsheetcollection.com/tags/Wizards-of-the-Coast/"},{"name":"Paizo Publishing","slug":"Paizo-Publishing","permalink":"https://realsheetcollection.com/tags/Paizo-Publishing/"}]}